#!/bin/sh

# see: https://github.com/Homebrew/homebrew-bundle

brew "ack"
brew "ag"
brew "autoenv"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bfg"
brew "bzr"
brew "cmake"
brew "coreutils"
brew "csshX"
brew "ctags-exuberant"
brew "ctop"
brew "curl"
brew "fd"
brew "findutils" # find, locate, updatedb, xargs
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "hub"
brew "libgccjit"
brew "libidn"
brew "lzlib"
brew "mermaid-cli"
brew "mysql"
brew "nvm"
brew "openssl"
brew "pstree"
brew "ripgrep"
brew "rlwrap"
brew "readline"
brew "svn" # needed for the occasional brew package
brew "terminal-notifier"
brew "tldr"
brew "tmux"
brew "watch"
brew "wget"
brew "webpack"

tap "d12frosted/emacs-plus"
brew "emacs-plus@29", args: ["with-imagemagick"], restart_service: :changed

# langs and development

brew "clojure"
brew "jenv"
brew "leiningen"
brew "node"
brew "python@3.9"
brew "flake8"
brew "pyenv"
brew "pyenv-virtualenv"
brew "poetry"
brew "rbenv"
brew "rbenv-bundler"
brew "ruby@2.7"
brew "ruby-build"
brew "postgresql@14"
brew "virtualenv"

#tap "zendesk/zendesk git@github.com:zendesk/homebrew-zendesk.git"

# apps

tap "homebrew/cask"

cask "chromedriver"

cask "docker"
#cask "firefox"
#cask "google-chrome"
cask "github"
cask "insomnia"
cask "iterm2"
cask "meld"
cask "musescore"
cask "mysqlworkbench"
cask "postman"
cask "proxyman"
cask "racket"
cask "rectangle"
cask "sourcetree"
cask "vagrant"
#cask "virtualbox" # 2021-11-24 still only intel, hasn't been ported to M1
cask "visual-studio-code"
cask "vlc"

cask "balenaetcher"

cask "flux"
cask "handbrake"
cask "transmission"

tap "homebrew/cask-fonts"

cask "font-camingocode"
cask "font-hack"
cask "font-inconsolata"
cask "font-juliamono"
cask "font-profont-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
