#!/bin/sh

# see: https://github.com/Homebrew/homebrew-bundle

brew "ack"
brew "ag"
brew "automake"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bzt"
brew "cheat"
brew "cmake"
brew "colima"
brew "coreutils"
brew "ctags"
brew "ctop"
brew "curl"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "emacs"
brew "fd"
brew "findutils" # find, locate, updatedb, xargs
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "glow"
brew "gpg"
brew "htop"
brew "hub"
brew "jq"
brew "just"
brew "libgccjit"
brew "logcli"
brew "loki"
brew "lzlib"
brew "mandown"
brew "man-db"
brew "msmtp"
brew "openssl"
brew "pstree"
brew "ripgrep"
brew "rlwrap"
brew "readline"
brew "ruff"
brew "shellcheck"
brew "svn" # needed for the occasional brew package
brew "tldr"
brew "tmux"
brew "tree"
brew "trivy"
brew "tsc"
brew "ty"
brew "uv"
brew "watch"
brew "webp"
brew "wget"
brew "webpack"
brew "yamllint"
brew "yq"
brew "zellij"

# langs and development

cask "claude-code"

brew "python@3.14"
brew "postgresql@18"

# apps

brew "gromgit/brewtils/taproom"
brew "mole"
brew "ollama"
brew "anomalyco/tap/opencode"

brew "hudochenkov/sshpass/sshpass"

cask "claudebar"
cask "dbvisualizer"
cask "github"
cask "google-chrome"
cask "handbrake-app"
cask "handy"
cask "iterm2"
cask "rectangle"
cask "transmission"
cask "vscodium"

cask "font-camingocode"
cask "font-hack"
cask "font-inconsolata"
cask "font-juliamono"
cask "font-profont-nerd-font"
cask "font-roboto-mono"
cask "font-roboto-mono-nerd-font"
cask "font-source-code-pro"
